# Stopクラスの定義
class Stop:
    def __init__(self, id, name, lat, lng, routes):  # 初期化メソッド
        self.id = id  # インスタンス変数に値を代入
        self.name = name
        self.lat = lat
        self.lng = lng
        self.routes = routes

    def countRoutes(self):
        return len(self.routes)


# 立命館大学前、同志社前、京大正門前、京都産大前、佛教大学前、龍谷大学前のStopオブジェクトを生成
ritsumeikan = Stop('ED01_1914', '立命館大学前', 35.03497163, 135.72602961, [
                   '12号系統', '15号系統', '50号系統', '51号系統', '55号系統', '59号系統', 'M1号系統', '快速202号系統', '快速205号系統'])
doshisha = Stop('ED01_1922', '同志社前', 35.02913136,
                135.76314762, ['201号系統', '203号系統', '59号系統'])
kyodai = Stop('ED01_1841', '京大正門前', 35.02548675, 135.7786403,
              ['201号系統', '206号系統', '31号系統', '65号系統'])
kyosan = Stop('ED01_2244', '京都産大前', 35.07182049,
              135.75638731, ['北3号系統', '直行号系統'])
ryukoku = Stop('ED01_2263', '龍谷大学前', 34.9631519, 135.76834405, ['南5号系統'])
